+ source common/common_pcp.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment.'
+ message='Start to prepare the test environment.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment.'
Fri Sep 22 04:52:15 2023 - INFO  - Start to prepare the test environment.
+ deploy_env
+ DNF_INSTALL pcp
+ pkgs=pcp
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs pcp --node 1 --tempfile ''
Fri Sep 22 04:52:39 2023 - INFO  - pkgs:(pcp) is already installed
+ tmpfile2=
+ '[' -z '' ']'
+ tmpfile=
+ systemctl enable pmcd
Created symlink /etc/systemd/system/multi-user.target.wants/pmcd.service → /usr/lib/systemd/system/pmcd.service.
+ systemctl start pmcd
+ systemctl enable pmlogger
Created symlink /etc/systemd/system/multi-user.target.wants/pmlogger.service → /usr/lib/systemd/system/pmlogger.service.
+ systemctl start pmlogger
Job for pmlogger.service failed because the control process exited with error code.
See "systemctl status pmlogger.service" and "journalctl -xeu pmlogger.service" for details.
+ SLEEP_WAIT 10
+ wait_time=10
+ cmd=
+ mode=1
+ python3 /root/mugen/libs/locallibs/sleep_wait.py --time 10 --cmd '' --mode 1
++ hostname
+ host_name=openeuler-riscv64
++ rpm -qa pcp
++ awk -F - '{print $2}'
+ pcp_version=5.3.7
+ LOG_INFO 'End to prepare the test environment.'
+ message='End to prepare the test environment.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment.'
Fri Sep 22 04:53:43 2023 - INFO  - End to prepare the test environment.
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start to run test.'
+ message='Start to run test.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to run test.'
Fri Sep 22 04:53:45 2023 - INFO  - Start to run test.
+ expect
spawn dbpmda -n /var/lib/pcp/pmns/root
dbpmda> quit
+ grep -iE 'fail|error' testlog1
+ CHECK_RESULT 1 1 0 'dbpmda_n Command executed failed'
+ actual_result=1
+ expect_result=1
+ mode=0
+ error_log='dbpmda_n Command executed failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 1x
+ return 0
+ expect
spawn dbpmda -f
dbpmda> quit
+ grep -iE 'fail|error' testlog2
+ CHECK_RESULT 1 1 0 'dbpmda_f Command executed failed'
+ actual_result=1
+ expect_result=1
+ mode=0
+ error_log='dbpmda_f Command executed failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 1x
+ return 0
+ expect
spawn dbpmda -q 3
dbpmda> quit
+ grep -iE 'fail|error' testlog3
+ CHECK_RESULT 1 1 0 'dbpmda_q Command executed failed'
+ actual_result=1
+ expect_result=1
+ mode=0
+ error_log='dbpmda_q Command executed failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 1x
+ return 0
+ expect
spawn dbpmda -U root
dbpmda> quit
+ grep -iE 'fail|error' testlog4
+ CHECK_RESULT 1 1 0 'dbpmda_U Command executed failed'
+ actual_result=1
+ expect_result=1
+ mode=0
+ error_log='dbpmda_U Command executed failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 1x
+ return 0
+ expect
spawn dbpmda -e
dbpmda> quit
+ grep -iE 'fail|error' testlog5
+ CHECK_RESULT 1 1 0 'dbpmda_e Command executed failed'
+ actual_result=1
+ expect_result=1
+ mode=0
+ error_log='dbpmda_e Command executed failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 1x
+ return 0
+ expect
spawn dbpmda -i
dbpmda> help
help [ command ]

attr name [value]
attr attr# [value]
children metric-name
close
debug all | none
debug [-]flag [ [-]flag ... ] (- prefix to clear)
desc metric
fetch metric [ metric ... ]
getdesc on | off
getiname on | off
instance indom# [ number | name | "name" ]
label context
label domain
label indom indom#
label cluster cluster#
label item metric
label instances indom#
name pmid#
namespace fname
open dso dsoname init_routine [ domain# ]
open pipe execname [ arg ... ]
open socket unix sockname
open socket inet port#|service
open socket ipv6 port#|service
pmid metric-name
profile indom# [ all | none ]
profile indom# [ add | delete ] number
quit
status
store metric "value"
text metric
text indom indom#
timer on | off
traverse metric-name
wait seconds
watch logfilename

dbpmda> timer on
dbpmda> timer off
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> close
Warning: No PMDA currently opened
dbpmda> wait 3
dbpmda> debug all
dbpmda> label context
Warning: No PMDA currently opened
dbpmda> quit
+ grep 'help \[ command \]' testlog6
help [ command ]
+ CHECK_RESULT 0
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log=
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End to run test.'
+ message='End to run test.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to run test.'
Fri Sep 22 04:53:54 2023 - INFO  - End to run test.
+ CASE_RESULT 0
+ case_re=0
+ test -z ''
+ test 0 -eq 0
+ LOG_INFO 'succeed to execute the case.'
+ message='succeed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'succeed to execute the case.'
Fri Sep 22 04:53:56 2023 - INFO  - succeed to execute the case.
+ exec_result=
+ exit 0
+ post_test
+ LOG_INFO 'Start to restore the test environment.'
+ message='Start to restore the test environment.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to restore the test environment.'
Fri Sep 22 04:53:57 2023 - INFO  - Start to restore the test environment.
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z '' ]]
+ [[ -z '' ]]
+ LOG_WARN 'no thing to do.'
+ message='no thing to do.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level warn --message 'no thing to do.'
Fri Sep 22 04:53:59 2023 - WARN  - no thing to do.
+ return 0
+ rm -f testlog1 testlog2 testlog3 testlog4 testlog5 testlog6
+ LOG_INFO 'End to restore the test environment.'
+ message='End to restore the test environment.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to restore the test environment.'
Fri Sep 22 04:54:01 2023 - INFO  - End to restore the test environment.
